cask_args appdir: '/Applications'

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "ValeLint/vale"

# Shell stuff
brew "fish"
brew "diff-so-fancy"
brew "thefuck"
brew "z"
brew "the_silver_searcher"
brew "fzf"

# Editor
brew "vim"
brew "neovim"
brew "go"
brew "bib-tool"
brew "vale"

# Mail
brew "mutt"
brew "gnupg"

# System
brew "coreutils"
brew "git"
brew "grep"
brew "tmux"
brew "openssh"

# Programming
brew "node"
brew "node-build"
brew "nodenv"
brew "python"
brew "rbenv"
brew "leiningen"
# brew "clojure-lsp"
brew "borkdude/brew/clj-kondo"
brew "yarn"
brew "heroku/brew/heroku"

# Writing
brew "diction"
brew "pandoc"
brew "pandoc-citeproc"

# Other
brew "tree"
brew "wget"

cask "font-firacode-nerd-font"
cask "seafile-client"
cask "flux"
cask "firefox"
cask "kitty"
cask "virtualbox"
cask "visual-studio-code"
cask "zotero"
cask "keycast"
# cask "dropbox"
# cask "nextcloud"
# cask "iterm2"
# cask "slack"
