xorg-server
xsel
lightdm
lightdm-gtk-greeter
xorg-xev
texlive-core
firefox
xlockmore
kitty
cargo
nodejs
npm
python
python-pip
neovim
vim
spectrwm
rofi
ripgrep
fd
htop
exa
fzf
bat
ttf-fira-code
neofetch
