openssh
xdg-utils
xorg-server
xorg-xsetroot
xclip
lightdm
lightdm-gtk-greeter
bspwm
sxhkd
rofi
texlive-core
xlockmore
firefox
kitty
rustup
nodejs
npm
python
python-pip
lua
luarocks
neovim
vim
fasd
ripgrep
fd
htop
exa
fzf
bat
jq
ttf-fira-code
tex-gyre-fonts
neofetch
zathura
zathura-pdf-poppler
pcmanfm
nnn
wireless_tools
dunst
libnotify
