openssh
xdg-utils
xorg-server
xsel
lightdm
lightdm-gtk-greeter
spectrwm
rofi
texlive-core
xlockmore
firefox
kitty
rustup
nodejs
npm
python
python-pip
lua
luarocks
neovim
vim
fasd
ripgrep
fd
htop
exa
fzf
bat
ttf-fira-code
tex-gyre-fonts
neofetch
shellcheck
zathura
zathura-pdf-poppler
thunar
tumbler
