awesome-git
bibtool
cava
libsearpc
mpdris2
mpv-mpris
ncspot
nerd-fonts-hack
otf-hasklig
otf-nerd-fonts-fira-code
perl-term-shellui
picom-ibhagwan-git
seadrive-daemon
shellcheck-bin
themix-gui-git
themix-icons-archdroid-git
themix-theme-oomox-git
tllocalmgr-git
zotero
river-git
stacktile
ristate
rofi-lbonn-wayland-git
rofi-dmenu
rofi-emoji
wlsunset
