awesome-git
bibtool
libsearpc
mpdris2
mpv-mpris
ncspot
otf-hasklig
otf-nerd-fonts-fira-code
perl-term-shellui
pacman-git
seadrive-daemon
shellcheck-bin
themix-gui-git
themix-icons-archdroid-git
themix-theme-oomox-git
tllocalmgr-git
zotero
rofi-dmenu
rofi-emoji
wezterm-nightly-bin
stylua
polkit-dumb-agent-git
dracula-gtk-theme-git
dracula-icons-git
