otf-nerd-fonts-fira-code
otf-hasklig
perl-term-shellui
picom-ibhagwan-git
shellcheck-bin
tllocalmgr-git
zotero
libsearpc
nerd-fonts-fantasque-sans-mono
themix-icons-archdroid-git
themix-gui-git
themix-theme-oomox-git
awesome-git
cava
mpdris2
ncspot
rofi-emoji
bibtool
mpv-mpris
c-lolcat
rofi-dmenu
