accountsservice
bat
cmake
exa
fd
fish
fzf
gptfdisk
htop
inetutils
iw
jq
kernel-modules-hook
lazygit
links
lua
luarocks
man-db
mlocate
neovim
networkmanager
nodejs
npm
openssh
pciutils
python
python-pip
python-poetry
python-pynvim
ripgrep
rsync
ruby
rustup
starship
tmux
ufw
unzip
usbutils
words
xdg-utils
zoxide
