openssh
unbound
expat
ufw
xdg-utils
xorg-server
xorg-xsetroot
xorg-xrdb
xclip
accountsservice
rofi
texlive-core
firefox
kitty
rustup
nodejs
npm
python
python-pip
lua
luarocks
vim
fasd
ripgrep
fd
htop
exa
fzf
bat
jq
ttf-fira-code
otf-fira-sans
tex-gyre-fonts
neofetch
zathura
zathura-pdf-poppler
nnn
cmst
libnotify
gnome-keyring
libsecret
unzip
materia-gtk-theme
redshift
feh
dex
pcmanfm-gtk3
fuse2
yajl
hsetroot
inetutils
deno
cups
cups-pdf
flatpak
tmux
xscreensaver
pipewire
pipewire-alsa
pipewire-pulse
pipewire-jack
unclutter
luarocks
shfmt
ttf-liberation
efm-langserver
mpd
ponymix
playerctl
