bash-language-server
biber
cups
cups-pdf
eslint_d
flake8
htmlhint
hunspell
hunspell-en_us
libreoffice-still
lua-language-server
neofetch
prettier
pyright
python-black
selene
shellharden
shfmt
stylua
texlive-basic
texlive-bibtexextra
texlive-core
texlive-fontsrecommended
texlive-latexextra
texlive-plaingeneric
texlive-xetex
typescript-language-server
vint
yaml-language-server
yamllint
