acpi
arc-gtk-theme
cups
cups-pdf
dex
dunst
feh
firefox
gnome-keyring
gnome-themes-extra
gnu-free-fonts
gtk-engine-murrine
gvfs
hsetroot
libnotify
libsecret
mpc
mpd
ncmpcpp
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
otf-fira-mono
otf-fira-sans
pamixer
papirus-icon-theme
pcmanfm-gtk3
picom
pipewire
pipewire-alsa
pipewire-pulse
playerctl
redshift
rofi
tex-gyre-fonts
texlive-core
ttf-fira-code
ttf-jetbrains-mono
ttf-joypixels
ttf-liberation
unclutter
wireplumber
xarchiver
xclip
xcolor
xdo
xdotool
xorg-server
xorg-xbacklight
xorg-xinit
xorg-xmodmap
xorg-xprop
xorg-xrdb
xorg-xsetroot
xscreensaver
yajl
youtube-dl
zathura
zathura-pdf-poppler
