karc-gtk-theme
aspell
aspell-en
diff-so-fancy
dunst
feh
firefox
firefox-decentraleyes
firefox-tridactyl
firefox-ublock-origin
flatpak
fuse2
gnome-keyring
gnome-themes-extra
gnu-free-fonts
gtk-engine-murrine
gvfs
hsetroot
libnotify
libsecret
libxres
lxsession-gtk3
mpc
mpd
ncmpcpp
nfs-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
otf-fira-mono
otf-fira-sans
pamixer
papirus-icon-theme
pcmanfm-gtk3
picom
pipewire
pipewire-alsa
pipewire-pulse
python-colorama
python-pywal
redshift
rofi
tex-gyre-fonts
trash-cli
ttf-fira-code
ttf-firacode-nerd
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-joypixels
ttf-liberation
udiskie
unclutter
wireplumber
wmctrl
xarchiver
xclip
xcolor
xdo
xdotool
xorg-server
xorg-xbacklight
xorg-xinit
xorg-xmodmap
xorg-xprop
xorg-xrdb
xorg-xsetroot
xorg-xwininfo
xscreensaver
yajl
zathura
zathura-pdf-poppler
