acpi
arc-gtk-theme
bash-language-server
bitwarden-cli
cups
cups-pdf
diff-so-fancy
dunst
eslint_d
feh
firefox
flake8
flatpak
fuse2
gnome-keyring
gnome-themes-extra
gnu-free-fonts
gtk-engine-murrine
gvfs
hsetroot
htmlhint
libnotify
libsecret
libxres
lua-language-server
lxsession-gtk3
mpc
mpd
ncmpcpp
neofetch
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
otf-fira-mono
otf-fira-sans
pamixer
papirus-icon-theme
pcmanfm-gtk3
picom
pipewire
pipewire-alsa
pipewire-pulse
prettier
pyright
python-black
python-colorama
python-pywal
redshift
rofi
selene
shellharden
shfmt
tex-gyre-fonts
texlive-core
trash-cli
ttf-fira-code
ttf-fira-code-nerd
ttf-jetbrains-mono
ttf-joypixels
ttf-liberation
typescript-language-server
udiskie
unclutter
vint
wezterm
wireplumber
xarchiver
xclip
xcolor
xdo
xdotool
xorg-server
xorg-xbacklight
xorg-xinit
xorg-xmodmap
xorg-xprop
xorg-xrdb
xorg-xsetroot
xorg-xwininfo
xscreensaver
yajl
yaml-language-server
yamllint
youtube-dl
zathura
zathura-pdf-poppler
