man-db
openssh
unbound
expat
ufw
xdg-utils
xorg-server
xorg-xsetroot
xorg-xrdb
xorg-xmodmap
xorg-xinit
xclip
accountsservice
texlive-core
firefox
kitty
cmake
rustup
nodejs
npm
python
python-pip
lua
luarocks
vim
fasd
ripgrep
fd
htop
exa
fzf
bat
jq
ttf-jetbrains-mono
ttf-fira-code
otf-fira-sans
otf-fira-mono
tex-gyre-fonts
neofetch
zathura
zathura-pdf-poppler
libnotify
gnome-keyring
libsecret
unzip
materia-gtk-theme
redshift
feh
dex
fuse2
yajl
hsetroot
inetutils
deno
cups
cups-pdf
flatpak
tmux
xscreensaver
pipewire
pipewire-alsa
pipewire-pulse
wireplumber
unclutter
luarocks
shfmt
ttf-liberation
mpd
playerctl
lua53-penlight
lua53-argparse
lua53-lgi
pamixer
networkmanager
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
gnu-free-fonts
words
mpv
youtube-dl
rofi
thunar
gvfs
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tumbler
xarchiver
gnome-themes-extra
gtk-engine-murrine
xcolor
papirus-icon-theme
arc-gtk-theme
